# 学习通的账号和密码
phone = "15286828533"
password = "Ksk517sXxt."

# 要刷的评论数量
count = 10

# 各门课程的回复窗口页的链接，刷完后随即注释掉或删掉链接
reply_urls = [
    # "https://groupweb.chaoxing.com/course/topic/v3/bbs/91cd7ea9dddb4ca106a7c802b5efce21/c6bb3820-effb-4825-93b2-41802bbf3f41/replysList?courseId=217458938&classId=39066549",  # 中华传统思想：对话先秦哲学
    # "https://groupweb.chaoxing.com/course/topic/v3/bbs/3548dcd44c3194c52ae69c41df5df12f/b3e5c956-4e65-4bd0-b1a6-52a71c201407/replysList?courseId=217458929&classId=39066485",  # 从泥巴到国粹：陶瓷绘画示范
    # "https://groupweb.chaoxing.com/course/topic/v3/bbs/cd68b9242ba9e2af6dbbf306ee3c5899/bbefdcf4-4538-4326-8f70-5eedc99f5171/replysList?courseId=217458923&classId=39066451",  # 美学原理
    # "https://groupweb.chaoxing.com/course/topic/v3/bbs/0218aec6007ca6240b8b643542c0f444/1345a7cc-5977-4f93-a1b6-41ef4e4b16b4/replysList?courseId=217458915&classId=39066277",  # 军事理论
    "https://groupweb.chaoxing.com/course/topic/v3/bbs/f7b74917b610e362ea15427ed7ca3211/c704d42298d6498c9f26840a42118700_topicDiscuss/replysList?courseId=216833995&classId=37659166",  # 网络营销
]

# 回复内容
reply_content = """1、自媒体
自媒体就是自己的媒体，这个自己可以是自然人也可以是企业、组织。
简单说：自媒体就是个人、企业、组织等通过互联网发布、传播信息的媒体平台。且自媒体火爆并非一日之功，乃互联网互动产品十年积累之大成。

2、新媒体
新媒体是指当下万物皆媒的环境，简单说：新媒体是一种环境。新媒体涵盖了所有数字化的媒体形式。包括所有数字化的传统媒体、网络媒体、移动端媒体、数字电视、数字报刊杂志等。
新媒体是一个相对的概念，同时也是一个宽泛的概念。

为什么说是一个相对的概念，是因为它是报刊、广播、电视等传统媒体以后发展起来的新的媒体形态，包括网络媒体、手机媒体、数字电视等。
新媒体应该称为数字化新媒体。
新媒体亦可从时间、技术、社会等三个维度做出理解：
时间：时间上更近的可以被称为较“新”的媒体：网络相对于电视是新媒体；电视相对于报纸是新媒体。

技术：价格更低廉，传播更广泛，应用更普遍，等等上述很多答友提到的革新技术的媒体都可以被认为是新媒体。

社会：新媒体之所以新，最重要的是社会作用的革新。当前的新媒体平台主要有：百度百家、今日头条、一点资讯、腾讯自媒体等等。

3、社会化媒体
社会化媒体是提供给大众主导信息传播的渠道，每个人都能自由发表意见和观点，想说就说、想写就写，不受传播渠道的约束，从这个意义上来说社会化媒体的定义在自媒体的范畴之中。
社会化媒体的核心在于社交。它十分注重用户的社交体验，致力于将现实中的人际关系同步转移到网络的虚拟世界中，颠覆之前的传统网络媒体的传播形式，信息的传递更多基于用户的社交网络。所以，我们可以把社会化媒体理解成是一种特殊的自媒体，它强调接收者由所有人变成基于社交网络的传播。

4、社交媒体是人们彼此之间用来分享意见、见解、经验和观点的工具和平台，现阶段主要包括社交网站、微博、微信、博客、论坛、播客等等。社交媒体在互联网的沃土上蓬勃发展，爆发出令人眩目的能量，其传播的信息已成为人们浏览互联网的重要内容，不仅制造了人们社交生活中争相讨论的一个又一个热门话题，更进而吸引传统媒体争相跟进。"""